// Що таке масиви в JavaScript?
// Масиви в JavaScript - це спеціальні об'єкти, які дозволяють зберігати колекції даних. Вони можуть містити будь-які типи даних, включаючи числа, рядки, об'єкти та навіть інші масиви. Масиви використовуються для організації та зберігання даних у вигляді списків або колекцій.

// Що таке функції?
// Функції в JavaScript - це блоки коду, які виконують певну задачу або обчислення. Вони можуть приймати аргументи, виконувати операції та повертати значення. Функції дозволяють організовувати код, повторно використовувати його та робити його більш читабельним і структурованим. В JavaScript функції є об'єктами першого класу, що означає, що їх можна присвоювати змінним, передавати як аргументи іншим функціям і повертати з інших функцій.

// Що таке ітерація та цикли?
// Ітерація - це процес повторного виконання певної операції або блоку коду. Цикли - це конструкції мови програмування, які дозволяють автоматично повторювати виконання блоку коду, поки не буде виконана певна умова. В JavaScript існують різні типи циклів: for, while, do-while.

//Імперативний код це як рецепт — набір покрокових інструкцій для отримання бажаного результату

// Декларативний код це як опис — фокус на тому, що потрібно зробити, а не на тому, як це зробити

// Імперативний код

const numbers = [1, 2, 3, 4, 5];
const filteredNum = [];

for (let i = 0; i < numbers.length; i++) {
  if (numbers[i] > 3) {
    filteredNum.push(numbers[i]);
  }
}
console.log(filteredNum); // [ 4, 5 ]

// Декларативний код

const numbers1 = [1, 2, 3, 4, 5];
const filteredNum1 = numbers1.filter((value) => {
  return value > 3;
});
console.log(filteredNum1); // [ 4, 5 ]

// Чисті функції

const dirtyMultiply = (array, value) => {
  for (let i = 0; i < array.length; i += 1) {
    array[i] = array[i] * value;
  }
};

const numbers2 = [1, 2, 3, 4, 5];

dirtyMultiply(numbers2, 3);

console.log(numbers2);

//

const user = {
  name: 'Ivan',
  age: 25
};


const { name, age } = user;

console.log(name); // 'Ivan' 
console.log(age);  // 25

const transaction = {
  id: 1,
  type: 'deposit',
  amount: 500
};

const {type, amount:sum, currency = 'USD'} = transaction

console.log(type);
console.log(sum);
console.log(currency);

