// Стрілочні функції — це не просто "короткий запис" звичайних функцій.

//Звичайна анонімна функція перетворюється на стрілочну за три кроки:
// Видаляємо слово function.
// Ставимо стрілку => після дужок з аргументами.
// Якщо код займає один рядок, видаляємо фігурні дужки {} та слово return.

// Was:

const add = function (a, b) {
  return a + b;
};

// Now (arrow function):

const add1 = (a, b) => a + b;

// Тут все дуже просто:

// 0 параметрів: Дужки обов'язкові: const greet = () => "Hello!";
// 1 параметр: Дужки можна опустити: const double = n => n * 2;
// 2+ параметри: Дужки обов'язкові: const sum = (a, b) => a + b;

//! У стрілочних функціях об'єкта arguments не існує!
